function จุดคุ้มทุนต่อหน่วย(ต้นทุนคงที่,ราคาขายต่อหน่วย,ต้นทุนผันแปรต่อหน่วย){
	return ต้นทุนคงที่ / (ราคาขายต่อหน่วย - ต้นทุนผันแปรต่อหน่วย);
}


function จุดคุ้มทุนต่อจำนวนเงิน(ต้นทุนคงที่,กำไรส่วนเกิน){
	return ต้นทุนคงที่ / กำไรส่วนเกิน;
}

function อัตรากำไรส่วนเกิน(ราคาขายต่อหน่วย,ต้นทุนผันแปรต่อหน่วย){
	return (ราคาขายต่อหน่วย - ต้นทุนผันแปรต่อหน่วย) / 100;
	
}


function ตารางเปรียบเทียบ(_){
	var ยอดขายเดิม = _.ยอดขายเดิม ;
	var ยอดขายใหม่ = _.ยอดขายใหม่ || _.ยอดขายเดิม;
	var ต้นทุนผันแปรเดิม = _.ต้นทุนผันแปรเดิม;
	var ต้นทุนผันแปรใหม่ = _.ต้นทุนผันแปรใหม่ || _.ต้นทุนผันแปรเดิม;
	var ต้นทุนคงที่เดิม = _.ต้นทุนคงที่เดิม;
	var ต้นทุนคงที่ใหม่ = _.ต้นทุนคงที่ใหม่ || _.ต้นทุนคงที่เดิม ;
	if (_.กำไรไม่น้อยกว่าที่ได้รับในปัจจุบัน){
		ยอดขายใหม่ = ยอดขายเดิม;
		return  "						เดิม			ใหม่			ส่วนต่าง\r\n" +
				"						------------------------------\r\n" +
				"	ยอดขาย				" + ยอดขายเดิม + "		" + (ยอดขายใหม่ + Math.abs(((ยอดขายใหม่ - ต้นทุนผันแปรใหม่)-ต้นทุนคงที่ใหม่)-((ยอดขายเดิม - ต้นทุนผันแปรเดิม)-ต้นทุนคงที่เดิม))) +"		" + Math.abs(((ยอดขายใหม่ - ต้นทุนผันแปรใหม่)-ต้นทุนคงที่ใหม่)-((ยอดขายเดิม - ต้นทุนผันแปรเดิม)-ต้นทุนคงที่เดิม)) + "\r\n" +
				"หัก	ต้นทุนผันแปร			" + ต้นทุนผันแปรเดิม + "		" + ต้นทุนผันแปรใหม่ +"		" + (ต้นทุนผันแปรใหม่-ต้นทุนผันแปรเดิม) + "\r\n" +
				"	กำไรส่วนเกิน			" + (ยอดขายเดิม - ต้นทุนผันแปรเดิม) + "		" + ((ยอดขายใหม่ - ต้นทุนผันแปรใหม่) + Math.abs(((ยอดขายใหม่ - ต้นทุนผันแปรใหม่)-ต้นทุนคงที่ใหม่)-((ยอดขายเดิม - ต้นทุนผันแปรเดิม)-ต้นทุนคงที่เดิม)) ) +"		" + ((ยอดขายใหม่ - ต้นทุนผันแปรใหม่)-(ยอดขายเดิม - ต้นทุนผันแปรเดิม)) + "\r\n" +
				"หัก	ต้นทุนคงที่				" + ต้นทุนคงที่เดิม + "		" + ต้นทุนคงที่ใหม่ +"		" + (ต้นทุนคงที่ใหม่-ต้นทุนคงที่เดิม) + "\r\n" +
				"	กำไรสุทธิ				" + ((ยอดขายเดิม - ต้นทุนผันแปรเดิม)-ต้นทุนคงที่เดิม) + "		" + ((ยอดขายเดิม - ต้นทุนผันแปรเดิม)-ต้นทุนคงที่เดิม) +"		" + (((ยอดขายเดิม - ต้นทุนผันแปรเดิม)-ต้นทุนคงที่เดิม)-((ยอดขายเดิม - ต้นทุนผันแปรเดิม)-ต้นทุนคงที่เดิม)) + "\r\n" 
		
		
	}
	
	
	return  "						เดิม			ใหม่			ส่วนต่าง\r\n" +
			"						------------------------------\r\n" +
			"	ยอดขาย				" + ยอดขายเดิม + "		" + ยอดขายใหม่ +"		" + (ยอดขายใหม่-ยอดขายเดิม) + "\r\n" +
			"หัก	ต้นทุนผันแปร			" + ต้นทุนผันแปรเดิม + "		" + ต้นทุนผันแปรใหม่ +"		" + (ต้นทุนผันแปรใหม่-ต้นทุนผันแปรเดิม) + "\r\n" +
			"	กำไรส่วนเกิน			" + (ยอดขายเดิม - ต้นทุนผันแปรเดิม) + "		" + (ยอดขายใหม่ - ต้นทุนผันแปรใหม่) +"		" + ((ยอดขายใหม่ - ต้นทุนผันแปรใหม่)-(ยอดขายเดิม - ต้นทุนผันแปรเดิม)) + "\r\n" +
			"หัก	ต้นทุนคงที่				" + ต้นทุนคงที่เดิม + "		" + ต้นทุนคงที่ใหม่ +"		" + (ต้นทุนคงที่ใหม่-ต้นทุนคงที่เดิม) + "\r\n" +
			"	กำไรสุทธิ				" + ((ยอดขายเดิม - ต้นทุนผันแปรเดิม)-ต้นทุนคงที่เดิม) + "		" + ((ยอดขายใหม่ - ต้นทุนผันแปรใหม่)-ต้นทุนคงที่ใหม่) +"		" + (((ยอดขายใหม่ - ต้นทุนผันแปรใหม่)-ต้นทุนคงที่ใหม่)-((ยอดขายเดิม - ต้นทุนผันแปรเดิม)-ต้นทุนคงที่เดิม)) + "\r\n" 
	
	
}

function ปริมาณขายเพื่อให้ได้กำไรที่ต้องการ(_){
	var ต้นทุนคงที่ = _.ต้นทุนคงที่;
	var กำไรหลังภาษี = _.กำไรหลังภาษี;
	var อัตราภาษี = _.อัตราภาษี;
	var กำไรส่วนเกินต่อหน่วย = _.กำไรส่วนเกินต่อหน่วย;
	
	return (ต้นทุนคงที่ + (กำไรหลังภาษี / (1-อัตราภาษี)) ) / กำไรส่วนเกินต่อหน่วย;
	
}

function xmlhttpRequestPVIFA(_){
	var อัตราดอกเบี้ย = _.อัตราดอกเบี้ย;
	var จำนวนปี = _.จำนวนปี;
	if(อัตราดอกเบี้ย == undefined || จำนวนปี == undefined) return ;
	
	var xhttp=new XMLHttpRequest();
    xhttp.onreadystatechange = function() {
        if (xhttp.readyState == 4 && xhttp.status == 200) {
             console.log(xhttp.responseText.replace(/<div .+><b>([0-9\.]+)<\/b><\/div>\n/gm,"$1"));
        }
    };
	xhttp.open("GET", "PVIFA.php?r=" + อัตราดอกเบี้ย +"&n=" + จำนวนปี, true);
	xhttp.send();
}

function PVIFA(_){
	var อัตราดอกเบี้ย = _.อัตราดอกเบี้ย;
	var จำนวนปี = _.จำนวนปี;
	if(อัตราดอกเบี้ย == undefined || จำนวนปี == undefined) return ;

	var sum = [];
	$("#PVIFA tr td[key="+จำนวนปี+"]").parent().each(function(a,b){
		sum.push($.map(b.innerText.replace(/\t/g,",").replace(/(^\d+,)/g,"").split(","),function(x){return parseFloat(x)}))
	})
	
	return	อัตราดอกเบี้ย <= 10 ?	sum[0][อัตราดอกเบี้ย-1] :
			อัตราดอกเบี้ย <= 20 ?	sum[1][อัตราดอกเบี้ย-11] :
							sum[2][อัตราดอกเบี้ย-21] ;
	
	
}


function NPV(_){
	var มูลค่าปัจจุบันของผลตอบแทน = _.มูลค่าปัจจุบันของผลตอบแทน;
	var เงินลงทุน = _.เงินลงทุน;
	return มูลค่าปัจจุบันของผลตอบแทน - เงินลงทุน;
}

function มูลค่าปัจจุบันของผลตอบแทน(จำนวนปี,อัตราดอกเบี้ย,เงินสดรับ){
	if(จำนวนปี == undefined || 
	   อัตราดอกเบี้ย == undefined || 
	   เงินสดรับ == undefined) return "Usage : มูลค่าปัจจุบันของผลตอบแทน(จำนวนปี,อัตราดอกเบี้ย,เงินสดรับ)";
	var x=0;
	for(i=1;i<=จำนวนปี;i++){
	 var _x=Math.round(เงินสดรับ/Math.pow(1+(อัตราดอกเบี้ย/100),i));
	 x+=_x;
	 console.log(_x+"	<<	"+เงินสดรับ+" / "+(1+(อัตราดอกเบี้ย/100))+" ยกกำลัง " + i);
	 if(i==จำนวนปี){
	   console.log(""+x);
	 }
	}
	return x;
}

function IRR(_){
	var ผลตอบแทน = _.ผลตอบแทน;
	var เงินลงทุน = _.เงินลงทุน;
	return เงินลงทุน/ผลตอบแทน;
}


console.log("1.1 จุดคุ้มทุนต่อหน่วย : " + จุดคุ้มทุนต่อหน่วย(700000+500000,100,40+12));
console.log("1.2 จุดคุ้มทุนต่อจำนวนเงิน : " + จุดคุ้มทุนต่อจำนวนเงิน(700000+500000,อัตรากำไรส่วนเกิน(100,52)));
console.log("\r\n\r\n");
console.log("2 : \r\n" + ตารางเปรียบเทียบ({
									ยอดขายเดิม:50000*100,
									ต้นทุนผันแปรเดิม:50000*(40+12),
									ต้นทุนคงที่เดิม:700000+500000,
									ยอดขายใหม่:60000*95,
									ต้นทุนผันแปรใหม่:60000*(40+12),
									ต้นทุนคงที่ใหม่:(700000+500000)+20000
									})
			+"\r\n");
console.log("3 : \r\n" + ตารางเปรียบเทียบ({
									ต้นทุนคงที่เดิม:700000+500000,
									ยอดขายเดิม:50000*100,
									ต้นทุนผันแปรเดิม:50000*(40+12),
									ต้นทุนคงที่ใหม่:700000+500000+40000,
									ต้นทุนผันแปรใหม่:50000*(40+12+8),
									กำไรไม่น้อยกว่าที่ได้รับในปัจจุบัน:"ใช่"
									})
			+"\r\n"
			+"\r\n ราคาขายต่อหน่วยใหม่  : " + 5440000 / 50000 + " บาท/หน่วย \r\n"
			);
			
			
console.log("4 : \r\n" + ปริมาณขายเพื่อให้ได้กำไรที่ต้องการ({
											ต้นทุนคงที่:700000+500000,
											กำไรหลังภาษี:1500000,
											อัตราภาษี:0.25,
											กำไรส่วนเกินต่อหน่วย:อัตรากำไรส่วนเกิน(100,40+12)*100
											})


			);

console.log("5 : \r\n"+
			"ส่วนเกินเพื่อความปลอดภัย		: " + ((50000*100)-(25000*100)) +"	หน่วย\r\n" +
			"ส่วนเกินเพื่อความปลอดภัย		: " + (((25000*100)/(50000*100))) +"		บาท\r\n" +
			"อัตราส่วนเกินเพื่อความปลอดภัย	: " + (((25000*100)/(50000*100))*100) +"		บาท\r\n"
			);
			
console.log("6 :   \r\n"+
				"PVIFA : " + PVIFA({อัตราดอกเบี้ย:9,จำนวนปี:5}) + "\r\n" +
				"มูลค่าปัจจุบันของผลตอบแทน : " + (800000 * PVIFA({อัตราดอกเบี้ย:9,จำนวนปี:5}) ) + "\r\n" +
				"มูลค่าปัจจุบันสุทธิ : " + NPV({มูลค่าปัจจุบันของผลตอบแทน:(800000*3.8897),เงินลงทุน:3000000}) + "\r\n" + 
				"IRR : " + IRR({ผลตอบแทน:800000,เงินลงทุน:3000000}) + "\r\n" +
				"ปีที่ 5 ค่าใกล้เคียงของ 3.75 \r\n" +
				"อัตราดอกเบี้ย 10% = 3.7908	อัตราดอกเบี้ย 12% = 3.6048 \r\n\r\n" +
				"ปีที่		มูลค่าปัจจุบัน		ตัวคุณอัตราส่วนลด		มูลค่าปัจจุบัน\r\n"+
				"		ของผลตอบแทน	10%		12%			10%		12%\r\n\r\n" + 
				"1-5		" + 800000 + "			"+3.7908+"	"+3.6048+"		"+3032640+"	"+2883840+"\r\n" +
				"หัก เงินลงทุน									"+3000000+"	"+3000000+"\r\n" + 
				"											"+(3032640-3000000)+"	"+(2883840-3000000)+"\r\n" +
				"-----------------------------------------------------------\r\n" +
				"มูลค่าปัจจุบันผลแตกต่าง	"+(3032640-2883840)+"	(3032640-2883840)	= " + 2 +"\r\n"+
				"					"+(3032640-3000000)+"	(3032640-3000000)	= (2*32640)/148800	= " + ((2*32640)/148800) + "\r\n\r\n" +
				"คิดอัตราตอบแทนของโครงการ	= (10%+0.439) = " + (0.439+10.00)  + "\r\n\r\n" +
				"อัตราผลตอบแทนของ		3000000 คือ 10.439% (IRR 3.75)\r\n\r\n" +
				"PI : ดัชนีกำไร	= " + ((800000*PVIFA({อัตราดอกเบี้ย:10,จำนวนปี:5}))/3000000).toFixed(3)
			);
			
